Revit 2024 API
AreaBasedLoadData.LoadType Property
 The load type of the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElectricalLoadType LoadType { get; }
Visual Basic
Public ReadOnly Property LoadType As ElectricalLoadType
	Get
Visual C++
public:
property ElectricalLoadType LoadType {
	ElectricalLoadType get ();
}
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace